In [111]:
import pandas as pd
import numpy as np

#### 새로운 데이터 생성

In [157]:
classes = pd.DataFrame({'name':['jack','eva','john','joy'],
                      'math':[90,85,88,76], 
                      'english':[75,83,92,81], 
                      'science':[60,90,77,83], 
                      'class':['a','a','b','c'], 
                        'club':['tennis','basketball',np.nan,np.nan]})
classes

   name  math  english  science class        club
0  jack    90       75       60     a      tennis
1   eva    85       83       90     a  basketball
2  john    88       92       77     b         NaN
3   joy    76       81       83     c         NaN

#### 사용자정의함수를 이용하여 세과목 평균 점수를 구하여라

In [158]:
def my_grade(math,english,science):
    return (math + english + science) / 3

In [159]:
classes['avg'] = classes.apply(lambda classes: my_grade(classes['math'],classes['english'],classes['science']), axis = 1)

In [161]:
classes = classes.round(1)
classes

   name  math  english  science class        club   avg
0  jack    90       75       60     a      tennis  75.0
1   eva    85       83       90     a  basketball  86.0
2  john    88       92       77     b         NaN  85.7
3   joy    76       81       83     c         NaN  80.0

In [ ]:
사용자정의함수

In [215]:
classes

   name  math  english  science avg        test class  club teacher
0  jack    90       75       60   a      tennis     a  fail
1   eva    85       83       90   a  basketball     a  pass
2  john    88       92       77   b           X     a  pass
3   joy    76       81       83   c           X     a  pass

#### 사용자정의함수를 이용하여 class별 수학평균점수를 구하고 rank를 이용하여 순위를 매겨라

In [162]:
class_math = grade[['math','class']]

In [163]:
class_math

   math class
0    90     a
1    85     a
2    88     b
3    76     c

In [164]:
def class_math_group(dataframe,col):
    return dataframe.groupby(col).mean()

In [165]:
class_math_group(class_math,'class')

       math
class
a      87.5
b      88.0
c      76.0

In [166]:
class_math['rank'] = class_math['math'].rank(ascending = False)

C:\Users\TJ\AppData\Local\Temp\ipykernel_12212\721164231.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  class_math['rank'] = class_math['math'].rank(ascending = False)

In [167]:
class_math

   math class  rank
0    90     a   1.0
1    85     a   3.0
2    88     b   2.0
3    76     c   4.0

#### eval함수를 이용하여 avg(평균점수)에 따른 통과여부를 판단하라

In [168]:
classes['test'] = ""

classes

   name  math  english  science class        club   avg test
0  jack    90       75       60     a      tennis  75.0
1   eva    85       83       90     a  basketball  86.0
2  john    88       92       77     b         NaN  85.7
3   joy    76       81       83     c         NaN  80.0

In [169]:
classes.loc[classes.eval('avg >= 80'), 'test'] = 'pass'

In [170]:
classes.loc[classes.eval('avg < 80'), 'test'] = 'fail'

In [171]:
classes

   name  math  english  science class        club   avg  test
0  jack    90       75       60     a      tennis  75.0  fail
1   eva    85       83       90     a  basketball  86.0  pass
2  john    88       92       77     b         NaN  85.7  pass
3   joy    76       81       83     c         NaN  80.0  pass

#### 사용자정의함수를 이용하여 'club' 열 결측치값을 모두 'X'로 지정하여라

In [172]:
def club_na(classes):
    classes['club'] = classes['club'].fillna("X")
    return classes

In [174]:
classes.pipe(club_na)

   name  math  english  science class        club   avg  test
0  jack    90       75       60     a      tennis  75.0  fail
1   eva    85       83       90     a  basketball  86.0  pass
2  john    88       92       77     b           X  85.7  pass
3   joy    76       81       83     c           X  80.0  pass

#### eval함수를 이용하여 세과목 평균 점수를 구하여라 (위 문제와 다른방식으로..)

In [193]:
classes2 = pd.DataFrame({'name':['jack','eva','john','joy'],
                      'math':[90,85,88,76], 
                      'english':[75,83,92,81], 
                      'science':[60,90,77,83]})
classes2

   name  math  english  science
0  jack    90       75       60
1   eva    85       83       90
2  john    88       92       77
3   joy    76       81       83

In [194]:
avg = classes2.eval('(math + english + science) / 3')

In [195]:
classes2['avg'] = avg

In [196]:
classes2

   name  math  english  science        avg
0  jack    90       75       60  75.000000
1   eva    85       83       90  86.000000
2  john    88       92       77  85.666667
3   joy    76       81       83  80.000000

In [199]:
classes2.round(1)

   name  math  english  science   avg
0  jack    90       75       60  75.0
1   eva    85       83       90  86.0
2  john    88       92       77  85.7
3   joy    76       81       83  80.0